Emissão/NFe/Exemplos XML/Exemplo_SOAP_Envio_Cancelamento.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inv="InvoiCy">
	<soapenv:Header/>
	<soapenv:Body>
		<inv:recepcao.Execute>
			<inv:Invoicyrecepcao>
				<inv:Cabecalho>
					<inv:EmpPK>YPxRwGxIbpWZtwhuC0m+Wg==</inv:EmpPK>
					<inv:EmpCK>b8f03da5dd1dcde6c640d58142d8d982</inv:EmpCK>
					<inv:EmpCO />
				</inv:Cabecalho>
				<inv:Informacoes>
					<inv:Texto/>
				</inv:Informacoes>
				<inv:Dados>
					<inv:DadosItem>
						<inv:Documento>
							&lt;EnvioEvento&gt;
	&lt;ModeloDocumento&gt;NFSe&lt;/ModeloDocumento&gt;
	&lt;Versao&gt;1&lt;/Versao&gt;
	&lt;Evento&gt;
		&lt;CNPJ&gt;88658984000224&lt;/CNPJ&gt;
		&lt;NFSeNumero&gt;901&lt;/NFSeNumero&gt;
		&lt;RPSNumero&gt;901&lt;/RPSNumero&gt;
		&lt;RPSSerie&gt;S&lt;/RPSSerie&gt;
		&lt;EveTp&gt;110111&lt;/EveTp&gt;
		&lt;tpAmb&gt;2&lt;/tpAmb&gt;
		&lt;NFSeCodVerificacao/&gt;
		&lt;Protocolo/&gt;
		&lt;NotaExiste/&gt;
		&lt;EveCodigo&gt;1&lt;/EveCodigo&gt;
		&lt;EveMotivo&gt;descrição do cancelamento&lt;/EveMotivo&gt;
	&lt;/Evento&gt;
&lt;/EnvioEvento&gt;
						</inv:Documento>
						<inv:Parametros/>
					</inv:DadosItem>
				</inv:Dados>
			</inv:Invoicyrecepcao>
		</inv:recepcao.Execute>
	</soapenv:Body>
</soapenv:Envelope>