Emissão/NFe/Exemplos XML/Exemplo envio SOAP NFe 4.0.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inv="InvoiCy">
	<soapenv:Header/>
	<soapenv:Body>
		<inv:recepcao.Execute>
			<inv:Invoicyrecepcao>
				<inv:Cabecalho>
					<inv:EmpPK>YPxRwGxIbpW568huC0m+Wg==</inv:EmpPK>
					<inv:EmpCK>e38ead8a337ff85bb1cb360ee1bc9ec1</inv:EmpCK>
					<inv:EmpCO/>
				</inv:Cabecalho>
				<inv:Informacoes>
					<inv:Texto/>
				</inv:Informacoes>
				<inv:Dados>
					<inv:DadosItem>
						<inv:Documento>
							&lt;Envio&gt;&lt;ModeloDocumento&gt;NFe&lt;/ModeloDocumento&gt;&lt;Versao&gt;4.00&lt;/Versao&gt;&lt;Parametros&gt;&lt;ApelidoLogomarca&gt;Logomarca&lt;/ApelidoLogomarca&gt;&lt;/Parametros&gt;&lt;ide&gt;&lt;cNF&gt;111&lt;/cNF&gt;&lt;cUF&gt;43&lt;/cUF&gt;&lt;natOp&gt;NFE CST 00&lt;/natOp&gt;&lt;mod&gt;55&lt;/mod&gt;&lt;serie&gt;20&lt;/serie&gt;&lt;nNF&gt;191&lt;/nNF&gt;&lt;dhEmi&gt;2017-07-19T17:01:00&lt;/dhEmi&gt;&lt;fusoHorario&gt;-03:00&lt;/fusoHorario&gt;&lt;tpNf&gt;1&lt;/tpNf&gt;&lt;idDest&gt;1&lt;/idDest&gt;&lt;indFinal&gt;0&lt;/indFinal&gt;&lt;indPres&gt;0&lt;/indPres&gt;&lt;cMunFg&gt;4321808&lt;/cMunFg&gt;&lt;tpImp&gt;1&lt;/tpImp&gt;&lt;tpEmis&gt;1&lt;/tpEmis&gt;&lt;tpAmb&gt;2&lt;/tpAmb&gt;&lt;finNFe&gt;1&lt;/finNFe&gt;&lt;EmailArquivos&gt;email@gmail.com.br&lt;/EmailArquivos&gt;&lt;/ide&gt;&lt;emit&gt;&lt;CNPJ_emit&gt;99999999999999&lt;/CNPJ_emit&gt;&lt;xNome&gt;Migrate&lt;/xNome&gt;&lt;xFant&gt;EMPRESADETESTE&lt;/xFant&gt;&lt;IE&gt;1234567891&lt;/IE&gt;&lt;CRT&gt;3&lt;/CRT&gt;&lt;enderEmit&gt;&lt;xLgr&gt;RUAAGOSTINHOCOSTI&lt;/xLgr&gt;&lt;nro&gt;1700&lt;/nro&gt;&lt;xCpl&gt;ANDAR02&lt;/xCpl&gt;&lt;xBairro&gt;BARRADOJACARE&lt;/xBairro&gt;&lt;cMun&gt;4321808&lt;/cMun&gt;&lt;xMun&gt;ENCANTADO&lt;/xMun&gt;&lt;UF&gt;RS&lt;/UF&gt;&lt;CEP&gt;95960000&lt;/CEP&gt;&lt;cPais&gt;1058&lt;/cPais&gt;&lt;xPais&gt;BRASIL&lt;/xPais&gt;&lt;fone&gt;5137513322&lt;/fone&gt;&lt;fax&gt;3335354830&lt;/fax&gt;&lt;/enderEmit&gt;&lt;/emit&gt;&lt;dest&gt;&lt;CNPJ_dest&gt;99999999999999&lt;/CNPJ_dest&gt;&lt;xNome_dest&gt;NF-E EMITIDA EM AMBIENTE DE HOMOLOGACAO - SEM VALOR FISCAL&lt;/xNome_dest&gt;&lt;indIEDest&gt;2&lt;/indIEDest&gt;&lt;enderDest&gt;&lt;nro_dest&gt;67&lt;/nro_dest&gt;&lt;xCpl_dest&gt;CENTRO&lt;/xCpl_dest&gt;&lt;xBairro_dest&gt;KENNEDY&lt;/xBairro_dest&gt;&lt;xEmail_dest&gt;email@gmail.com&lt;/xEmail_dest&gt;&lt;xLgr_dest&gt;ROD BR 040 KM 688 AREA ESPECIAL 11&lt;/xLgr_dest&gt;&lt;xPais_dest&gt;Brasil&lt;/xPais_dest&gt;&lt;cMun_dest&gt;4309605&lt;/cMun_dest&gt;&lt;xMun_dest&gt;CONTAGEM&lt;/xMun_dest&gt;&lt;UF_dest&gt;RS&lt;/UF_dest&gt;&lt;CEP_dest&gt;32145900&lt;/CEP_dest&gt;&lt;cPais_dest&gt;1058&lt;/cPais_dest&gt;&lt;fone_dest&gt;5535481105&lt;/fone_dest&gt;&lt;/enderDest&gt;&lt;/dest&gt;&lt;autXML&gt;&lt;autXMLItem&gt;&lt;CNPJ_aut&gt;99999999999999&lt;/CNPJ_aut&gt;&lt;/autXMLItem&gt;&lt;/autXML&gt;&lt;det&gt;&lt;detItem&gt;&lt;prod&gt;&lt;cProd&gt;45093842304843&lt;/cProd&gt;&lt;cEAN/&gt;&lt;xProd&gt;MOTOCICLETA  MARCA HONDA, TIPO CB 300 R ANO DE FABRICACAO 2009 ANO MODELO 2010&lt;/xProd&gt;&lt;NCM&gt;87112020&lt;/NCM&gt;&lt;EXTIPI&gt;87&lt;/EXTIPI&gt;&lt;CFOP&gt;5102&lt;/CFOP&gt;&lt;uCOM&gt;BOT&lt;/uCOM&gt;&lt;qCOM&gt;1.0000&lt;/qCOM&gt;&lt;vUnCom&gt;9975.2100&lt;/vUnCom&gt;&lt;vProd&gt;9975.21&lt;/vProd&gt;&lt;cEANTrib/&gt;&lt;uTrib&gt;BOT&lt;/uTrib&gt;&lt;qTrib&gt;1.00&lt;/qTrib&gt;&lt;vUnTrib&gt;9975.21&lt;/vUnTrib&gt;&lt;vFrete&gt;0.00&lt;/vFrete&gt;&lt;vSeg&gt;0.00&lt;/vSeg&gt;&lt;vDesc&gt;0.00&lt;/vDesc&gt;&lt;indTot&gt;1&lt;/indTot&gt;&lt;nTipoItem&gt;1&lt;/nTipoItem&gt;&lt;nRECOPI&gt;123456&lt;/nRECOPI&gt;&lt;veicProd&gt;&lt;tpOp&gt;1&lt;/tpOp&gt;&lt;chassi&gt;9C2NC4310AR033234&lt;/chassi&gt;&lt;cCor&gt;PRME&lt;/cCor&gt;&lt;xCor&gt;PRATA METALICO&lt;/xCor&gt;&lt;pot&gt;2600&lt;/pot&gt;&lt;cilin&gt;0291&lt;/cilin&gt;&lt;PesoL&gt;000000143&lt;/PesoL&gt;&lt;PesoB&gt;000000175&lt;/PesoB&gt;&lt;nSerie&gt;0AR033234&lt;/nSerie&gt;&lt;tpComb&gt;02&lt;/tpComb&gt;&lt;nMotor&gt;NC43E1A033234&lt;/nMotor&gt;&lt;CMT&gt;00179.000&lt;/CMT&gt;&lt;dist&gt;1402&lt;/dist&gt;&lt;anoMod&gt;2010&lt;/anoMod&gt;&lt;anoFab&gt;2009&lt;/anoFab&gt;&lt;tpPint&gt;M&lt;/tpPint&gt;&lt;tpVeic&gt;04&lt;/tpVeic&gt;&lt;espVeic&gt;01&lt;/espVeic&gt;&lt;VIN&gt;N&lt;/VIN&gt;&lt;condVeic&gt;1&lt;/condVeic&gt;&lt;cMod&gt;2710&lt;/cMod&gt;&lt;cCorDENATRAN&gt;04&lt;/cCorDENATRAN&gt;&lt;lota&gt;2&lt;/lota&gt;&lt;tpRest&gt;0&lt;/tpRest&gt;&lt;/veicProd&gt;&lt;/prod&gt;&lt;imposto&gt;&lt;ICMS&gt;&lt;orig&gt;0&lt;/orig&gt;&lt;CST&gt;40&lt;/CST&gt;&lt;modBC&gt;0&lt;/modBC&gt;&lt;vBC&gt;0.00&lt;/vBC&gt;&lt;pICMS&gt;0.00&lt;/pICMS&gt;&lt;vICMS_icms&gt;0.00&lt;/vICMS_icms&gt;&lt;pRedBC&gt;0.00&lt;/pRedBC&gt;&lt;pBCOp&gt;0.00&lt;/pBCOp&gt;&lt;pFCP&gt;0.00&lt;/pFCP&gt;&lt;vFCP&gt;0.00&lt;/vFCP&gt;&lt;vBCFCP&gt;0.00&lt;/vBCFCP&gt;&lt;vBCFCPST&gt;0.00&lt;/vBCFCPST&gt;&lt;pFCPST&gt;0.00&lt;/pFCPST&gt;&lt;vFCPST&gt;0.00&lt;/vFCPST&gt;&lt;pST&gt;0.00&lt;/pST&gt;&lt;vBCFCPSTRet&gt;0.00&lt;/vBCFCPSTRet&gt;&lt;pFCPSTRet&gt;0.00&lt;/pFCPSTRet&gt;&lt;vFCPSTRet&gt;0.00&lt;/vFCPSTRet&gt;&lt;/ICMS&gt;&lt;PIS&gt;&lt;CST_pis&gt;07&lt;/CST_pis&gt;&lt;/PIS&gt;&lt;COFINS&gt;&lt;CST_cofins&gt;07&lt;/CST_cofins&gt;&lt;/COFINS&gt;&lt;/imposto&gt;&lt;infADProd&gt;COR PRATA METALICO GASOLINA, COM 26,5HP, 291 CC COM 0KM, PROCEDENCIA NACIONAL. |CHASSI: 9C2NC4310AR033234 MOTOR : NC43E1A033234 CLASS.FISCAL: 87113000 CODIGO RENAVAM: 2710 NFE:124933/1 de:22/09/2009&lt;/infADProd&gt;&lt;/detItem&gt;&lt;/det&gt;&lt;total&gt;&lt;ICMStot&gt;&lt;vBC_ttlnfe&gt;00.00&lt;/vBC_ttlnfe&gt;&lt;vICMS_ttlnfe&gt;00.00&lt;/vICMS_ttlnfe&gt;&lt;vICMSDeson_ttlnfe&gt;0.00&lt;/vICMSDeson_ttlnfe&gt;&lt;vBCST_ttlnfe&gt;0.00&lt;/vBCST_ttlnfe&gt;&lt;vST_ttlnfe&gt;0.00&lt;/vST_ttlnfe&gt;&lt;vProd_ttlnfe&gt;9975.21&lt;/vProd_ttlnfe&gt;&lt;vFrete_ttlnfe&gt;0&lt;/vFrete_ttlnfe&gt;&lt;vSeg_ttlnfe&gt;0&lt;/vSeg_ttlnfe&gt;&lt;vDesc_ttlnfe&gt;0&lt;/vDesc_ttlnfe&gt;&lt;vII_ttlnfe&gt;0.00&lt;/vII_ttlnfe&gt;&lt;vIPI_ttlnfe&gt;0&lt;/vIPI_ttlnfe&gt;&lt;vPIS_ttlnfe&gt;0&lt;/vPIS_ttlnfe&gt;&lt;vCOFINS_ttlnfe&gt;0&lt;/vCOFINS_ttlnfe&gt;&lt;vOutro&gt;0&lt;/vOutro&gt;&lt;vNF&gt;9975.21&lt;/vNF&gt;&lt;vFCP_ttlnfe&gt;0.00&lt;/vFCP_ttlnfe&gt;&lt;vFCPST_ttlnfe&gt;0.00&lt;/vFCPST_ttlnfe&gt;&lt;vFCPSTRet_ttlnfe&gt;0.00&lt;/vFCPSTRet_ttlnfe&gt;&lt;vIPIDevol_ttlnfe&gt;0.00&lt;/vIPIDevol_ttlnfe&gt;&lt;/ICMStot&gt;&lt;/total&gt;&lt;transp&gt;&lt;modFrete&gt;9&lt;/modFrete&gt;&lt;veicTransp&gt;&lt;placa&gt;IDN1565&lt;/placa&gt;&lt;UF_veictransp&gt;RS&lt;/UF_veictransp&gt;&lt;RNTC&gt;00811004&lt;/RNTC&gt;&lt;/veicTransp&gt;&lt;reboque&gt;&lt;reboqueItem&gt;&lt;placa_rebtransp&gt;CHI488&lt;/placa_rebtransp&gt;&lt;UF_rebtransp&gt;RS&lt;/UF_rebtransp&gt;&lt;RNTC_rebtransp&gt;00811004&lt;/RNTC_rebtransp&gt;&lt;/reboqueItem&gt;&lt;reboqueItem&gt;&lt;placa_rebtransp&gt;CH4985&lt;/placa_rebtransp&gt;&lt;UF_rebtransp&gt;RS&lt;/UF_rebtransp&gt;&lt;RNTC_rebtransp&gt;00811004&lt;/RNTC_rebtransp&gt;&lt;/reboqueItem&gt;&lt;/reboque&gt;&lt;/transp&gt;&lt;pag&gt;&lt;pagItem&gt;&lt;tPag&gt;01&lt;/tPag&gt;&lt;vPag&gt;9975.21&lt;/vPag&gt;&lt;/pagItem&gt;&lt;/pag&gt;&lt;vTroco&gt;0.00&lt;/vTroco&gt;&lt;infAdic&gt;&lt;infAdFisco&gt;INFORMACOES DE INTERESSE DO FISCO&lt;/infAdFisco&gt;&lt;infCpl&gt;7898080640413 7898904418150 7898117960019 7898904418150 7898080640413 7898117960019 7891107101621 7891091018011 7898909484129 7891024113783 7896387016139 7896041172539 7896213000677 7896213002091 7891010503024 4992 2284 2282 2300 2286 2320 2297 2314 2287 Maecenas ipsum velit, consectetuer eu, lobortis ut, dictum at, dui. In rutrum. Sed ac dolor sit amet purus malesuada congue. In laoreet, magna id viverra tincidunt, sem odio bibendum justo, vel imperdiet sapien wisi sed libero. Suspendisse sagittis ultrices augue. Mauris metus. Nunc dapibus tortor vel mi dapibus sollicitudin. Etiam posuere lacus quis dolor. Praesent id justo in neque elementum ultrices. Class aptent taciti sociosqu ad litora torquent per conubia nostra, per inceptos hymenaeos. In convallis. Fusce suscipit libero eget elit. Praesent vitae arcu tempor neque lacinia pretium. Morbi imperdiet, mauris ac auctor dictum, nisl ligula egestas nulla, et sollicitudin sem purus in lacus.&lt;/infCpl&gt;&lt;/infAdic&gt;&lt;/Envio&gt;
						</inv:Documento>
						<inv:Parametros/>
					</inv:DadosItem>
				</inv:Dados>
			</inv:Invoicyrecepcao>
		</inv:recepcao.Execute>
	</soapenv:Body>
</soapenv:Envelope>